In [6]:
import pandas as pd
import seaborn as sns

In [19]:
tips = sns.load_dataset('tips')
tips.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [8]:
titanic = pd.read_csv('tested.csv')

In [17]:
flights = sns.load_dataset('flights')
flights.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [10]:
iris = sns.load_dataset('iris')

# Bivariate and Multivarite

## Scatterplot ( Numerical - Numerical )

In [20]:
sns.scatterplot(tips['total_bill'], tips['tip'])

TypeError: scatterplot() takes from 0 to 1 positional arguments but 2 were given